; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_12_6)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 - boat
		p0 p1 p2 p3 p4 p5 - person
	)

  (:init
		(= (x b0) 9)
(= (y b0) 0)
(= (x b1) 3)
(= (y b1) 0)
(= (x b2) 6)
(= (y b2) 0)
(= (x b3) -6)
(= (y b3) 0)
(= (x b4) -7)
(= (y b4) 0)
(= (x b5) 7)
(= (y b5) 0)
(= (x b6) 1)
(= (y b6) 0)
(= (x b7) 0)
(= (y b7) 0)
(= (x b8) -6)
(= (y b8) 0)
(= (x b9) -6)
(= (y b9) 0)
(= (x b10) 3)
(= (y b10) 0)
(= (x b11) 1)
(= (y b11) 0)

		(= (d p0) 7)
(= (d p1) 65)
(= (d p2) 67)
(= (d p3) 65)
(= (d p4) 60)
(= (d p5) 63)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
		)
	)
)

; plan
1. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 0 to 1.5
   goals met: 0 of 6
2. (go_north_east b7)
   changed: (x b7) from 1.5 to 3, (y b7) from 1.5 to 3
   goals met: 0 of 6
3. (go_north_east b7)
   changed: (x b7) from 3 to 4.5, (y b7) from 3 to 4.5
   goals met: 0 of 6
4. (go_north_west b7)
   changed: (x b7) from 4.5 to 3, (y b7) from 4.5 to 6
   goals met: 0 of 6
5. (go_north_west b7)
   changed: (x b7) from 3 to 1.5, (y b7) from 6 to 7.5
   goals met: 0 of 6
6. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 7.5 to 9
   goals met: 0 of 6
7. (save_person b7 p0)
   added: (saved p0)
   goals met: 1 of 6
8. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 9 to 10.5
   goals met: 1 of 6
9. (go_north_east b7)
   changed: (x b7) from 1.5 to 3, (y b7) from 10.5 to 12
   goals met: 1 of 6
10. (go_north_east b7)
   changed: (x b7) from 3 to 4.5, (y b7) from 12 to 13.5
   goals met: 1 of 6
11. (go_north_east b7)
   changed: (x b7) from 4.5 to 6, (y b7) from 13.5 to 15
   goals met: 1 of 6
12. (go_north_east b7)
   changed: (x b7) from 6 to 7.5, (y b7) from 15 to 16.5
   goals met: 1 of 6
13. (go_north_east b7)
   changed: (x b7) from 7.5 to 9, (y b7) from 16.5 to 18
   goals met: 1 of 6
14. (go_north_east b7)
   changed: (x b7) from 9 to 10.5, (y b7) from 18 to 19.5
   goals met: 1 of 6
15. (go_north_east b7)
   changed: (x b7) from 10.5 to 12, (y b7) from 19.5 to 21
   goals met: 1 of 6
16. (go_north_east b7)
   changed: (x b7) from 12 to 13.5, (y b7) from 21 to 22.5
   goals met: 1 of 6
17. (go_north_east b7)
   changed: (x b7) from 13.5 to 15, (y b7) from 22.5 to 24
   goals met: 1 of 6
18. (go_north_east b7)
   changed: (x b7) from 15 to 16.5, (y b7) from 24 to 25.5
   goals met: 1 of 6
19. (go_north_east b7)
   changed: (x b7) from 16.5 to 18, (y b7) from 25.5 to 27
   goals met: 1 of 6
20. (go_north_east b7)
   changed: (x b7) from 18 to 19.5, (y b7) from 27 to 28.5
   goals met: 1 of 6
21. (go_north_east b7)
   changed: (x b7) from 19.5 to 21, (y b7) from 28.5 to 30
   goals met: 1 of 6
22. (go_north_east b7)
   changed: (x b7) from 21 to 22.5, (y b7) from 30 to 31.5
   goals met: 1 of 6
23. (go_north_east b7)
   changed: (x b7) from 22.5 to 24, (y b7) from 31.5 to 33
   goals met: 1 of 6
24. (go_north_east b7)
   changed: (x b7) from 24 to 25.5, (y b7) from 33 to 34.5
   goals met: 1 of 6
25. (go_north_east b7)
   changed: (x b7) from 25.5 to 27, (y b7) from 34.5 to 36
   goals met: 1 of 6
26. (go_north_east b7)
   changed: (x b7) from 27 to 28.5, (y b7) from 36 to 37.5
   goals met: 1 of 6
27. (go_north_west b7)
   changed: (x b7) from 28.5 to 27, (y b7) from 37.5 to 39
   goals met: 1 of 6
28. (go_north_west b7)
   changed: (x b7) from 27 to 25.5, (y b7) from 39 to 40.5
   goals met: 1 of 6
29. (go_north_west b7)
   changed: (x b7) from 25.5 to 24, (y b7) from 40.5 to 42
   goals met: 1 of 6
30. (go_north_west b7)
   changed: (x b7) from 24 to 22.5, (y b7) from 42 to 43.5
   goals met: 1 of 6
31. (go_north_west b7)
   changed: (x b7) from 22.5 to 21, (y b7) from 43.5 to 45
   goals met: 1 of 6
32. (go_north_west b7)
   changed: (x b7) from 21 to 19.5, (y b7) from 45 to 46.5
   goals met: 1 of 6
33. (go_north_west b7)
   changed: (x b7) from 19.5 to 18, (y b7) from 46.5 to 48
   goals met: 1 of 6
34. (go_north_west b7)
   changed: (x b7) from 18 to 16.5, (y b7) from 48 to 49.5
   goals met: 1 of 6
35. (go_north_west b7)
   changed: (x b7) from 16.5 to 15, (y b7) from 49.5 to 51
   goals met: 1 of 6
36. (go_north_west b7)
   changed: (x b7) from 15 to 13.5, (y b7) from 51 to 52.5
   goals met: 1 of 6
37. (go_north_west b7)
   changed: (x b7) from 13.5 to 12, (y b7) from 52.5 to 54
   goals met: 1 of 6
38. (go_north_west b7)
   changed: (x b7) from 12 to 10.5, (y b7) from 54 to 55.5
   goals met: 1 of 6
39. (go_north_west b7)
   changed: (x b7) from 10.5 to 9, (y b7) from 55.5 to 57
   goals met: 1 of 6
40. (go_north_west b7)
   changed: (x b7) from 9 to 7.5, (y b7) from 57 to 58.5
   goals met: 1 of 6
41. (go_north_west b7)
   changed: (x b7) from 7.5 to 6, (y b7) from 58.5 to 60
   goals met: 1 of 6
42. (go_north_west b7)
   changed: (x b7) from 6 to 4.5, (y b7) from 60 to 61.5
   goals met: 1 of 6
43. (go_north_west b7)
   changed: (x b7) from 4.5 to 3, (y b7) from 61.5 to 63
   goals met: 1 of 6
44. (save_person b7 p4)
   added: (saved p4)
   goals met: 2 of 6
45. (go_north_west b7)
   changed: (x b7) from 3 to 1.5, (y b7) from 63 to 64.5
   goals met: 2 of 6
46. (save_person b7 p5)
   added: (saved p5)
   goals met: 3 of 6
47. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 64.5 to 66
   goals met: 3 of 6
48. (save_person b7 p1)
   added: (saved p1)
   goals met: 4 of 6
49. (save_person b7 p3)
   added: (saved p3)
   goals met: 5 of 6
50. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 66 to 67.5
   goals met: 5 of 6
51. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 67.5 to 69
   goals met: 5 of 6
52. (save_person b7 p2)
   added: (saved p2)
   goals met: 6 of 6
